Updated docs and cleaned up more code. (#21)
